In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
df_sg = pd.read_csv('/mnt/c/Users/Dleg/Data/MOPC/MOPC/Enriquecimiento de Datos/Data Cleaning/Clientes/BBVA/Datasets/0202/INFO_MOPCRC_BBVA_210201.csv', sep=';')

## Sal_Gestor

In [3]:
df_sg.head()

,Tr�mite,DNI,Operaci�n,Producto,Subproducto,Desc_Subproducto,Nombre_Cliente,Domicilio,numero,piso,...,Cotitulares,F33,F34,F35,ID_AGENCIA,MOPC,FECHA,DEUDA_NETA,SALDO_CONT,DEUDA_CLIENTE
0,151095739,00-00000029014827,0017-0147-79-00114001,79-CUENTA VISA,P,ORO,LEMOS JORGE CARLOS,CLAUDIO MAMERTO CUENCA,1612,NaN,...,NaN,7,0,NaN,NaN,NaN,NaN,0.0,5341,"5340,67"
1,153614456,00-00000014590547,0017-0311-79-00217372,79-CUENTA VISA,C,CLASIC,COLASSO MARTA NIEVES,TANDIL,4255,NaN,...,NaN,7,0,NaN,NaN,NaN,NaN,0.0,0,0
2,154245409,00-00000038230228,0017-0322-79-00355019,79-CUENTA VISA,C,CLASIC,PEREZ MICAELA,PRES JUAN DOMINGO PERON,2575,1,...,NaN,7,0,NaN,NaN,NaN,NaN,0.0,1,"0,7"
3,154247520,00-00000022308096,0017-0288-79-00055542,79-CUENTA VISA,C,CLASIC,MONDOTEGUY MIRTA LILIANA,CALLE 62 BIS,1032,NaN,...,NaN,7,0,NaN,NaN,NaN,NaN,0.0,0,0
4,156311554,00-00000017999492,0017-0264-01-00084529,01-CUENTA CORRIENTE PESOS,2010,NaN,FERNANDEZ RAIMUNDO JAVIER,CORONA MARTINEZ CASA1393,0,NaN,...,NaN,7,0,NaN,NaN,NaN,NaN,0.0,16272,"16272,49"

In [4]:
df_reduced_sg = df_sg [['DNI','Cotitulares']]

- IDMOROSO, TIPO_DOC, NRO_DOC, NOMBRE, :  0102.xlsx
- CUIT no lo tengo
- Datos Cotitular: Sal_Gestor

Join por DNI

In [5]:
df_reduced_sg.head()

                 DNI Cotitulares
0  00-00000029014827         NaN
1  00-00000014590547         NaN
2  00-00000038230228         NaN
3  00-00000022308096         NaN
4  00-00000017999492         NaN

## DNI Cleaning

In [6]:
df_reduced_sg ['DNI'] = df_reduced_sg ['DNI'].str.split('-').str[1]

<ipython-input-6-987d781af3fb>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_reduced_sg ['DNI'] = df_reduced_sg ['DNI'].str.split('-').str[1]

In [7]:
df_reduced_sg.head()

              DNI Cotitulares
0  00000029014827         NaN
1  00000014590547         NaN
2  00000038230228         NaN
3  00000022308096         NaN
4  00000017999492         NaN

Pasamos a int para volar esos 0s

In [8]:
df_reduced_sg ['DNI'] = df_reduced_sg ['DNI'].astype(int)

<ipython-input-8-ce4575868871>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_reduced_sg ['DNI'] = df_reduced_sg ['DNI'].astype(int)

In [9]:
df_reduced_sg.head()

        DNI Cotitulares
0  29014827         NaN
1  14590547         NaN
2  38230228         NaN
3  22308096         NaN
4  17999492         NaN

Volvemos a str para luego hacer el join

In [10]:
df_reduced_sg ['DNI'] = df_reduced_sg ['DNI'].astype(str)

<ipython-input-10-41a1021061c1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_reduced_sg ['DNI'] = df_reduced_sg ['DNI'].astype(str)

In [11]:
df_reduced_sg.head()

        DNI Cotitulares
0  29014827         NaN
1  14590547         NaN
2  38230228         NaN
3  22308096         NaN
4  17999492         NaN

## Datos Cotitular

In [12]:
df_reduced_sg ['Cotitulares'] = df_reduced_sg ['Cotitulares'].str.split('/')

<ipython-input-12-1426c4d468e7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_reduced_sg ['Cotitulares'] = df_reduced_sg ['Cotitulares'].str.split('/')

In [13]:
df_reduced_sg[df_reduced_sg ['DNI'] == '22718853']

           DNI                                        Cotitulares
6700  22718853  [ADICIONAL TARJETA                            ...
6701  22718853                                                NaN

In [14]:
#df_reduced_sg.explode('Datos cotitular')

In [15]:
#df_reduced_sg ['Datos_cotitular_clean'] = [df_reduced_sg['Cotitulares'][i][10:] if len(str(df_reduced_sg['Cotitulares'][i])> 8 else np.nan for i in range (df_reduced_sg['Cotitulares'].count())]

In [16]:
df_reduced_sg ['Datos_cotitular_clean'] = df_reduced_sg['Cotitulares']

<ipython-input-16-ddd32459e4f0>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_reduced_sg ['Datos_cotitular_clean'] = df_reduced_sg['Cotitulares']

In [17]:
df_reduced_sg = df_reduced_sg [['DNI','Datos_cotitular_clean']]

In [18]:
df_reduced_sg = df_reduced_sg.explode('Datos_cotitular_clean')

In [19]:
df_reduced_sg.head()

        DNI Datos_cotitular_clean
0  29014827                   NaN
1  14590547                   NaN
2  38230228                   NaN
3  22308096                   NaN
4  17999492                   NaN

In [20]:
df_reduced_sg.shape

(17546, 2)

In [21]:
df_reduced_sg ['Datos_cotitular_clean'] = df_reduced_sg['Datos_cotitular_clean'].str.strip()

### Dropeamos NaNs

In [22]:
df_reduced_sg = df_reduced_sg.dropna(axis=0)

In [23]:
df_reduced_sg.tail()

            DNI Datos_cotitular_clean
10620  25277262           02994440500
10620  25277262           02994982436
10620  25277262           02994401010
10620  25277262
10620  25277262                     -

In [24]:
df_reduced_sg.shape

(7291, 2)

In [25]:
#df_reduced_sg[df_reduced_sg['DNI'] == '27535549']

In [26]:
#s = df_reduced_sg[df_reduced_sg['DNI'] == '27535549']

Nos quedamos sólo con los números de teléfono

In [27]:
df_clean = df_reduced_sg[(df_reduced_sg['Datos_cotitular_clean'].str.isdigit()) & (df_reduced_sg['Datos_cotitular_clean'].str.len() >=8)]

In [28]:
df_clean.head()

        DNI Datos_cotitular_clean
5  17999492            1559436976
5  17999492              48053932
5  17999492              48280546
6  17999492            1559436976
6  17999492              48053932

In [29]:
df_clean = df_clean.rename(columns = {'DNI':'NRO_DOC','Datos_cotitular_clean': 'DATO'})

In [30]:
df_clean.shape

(1092, 2)

In [31]:
df_clean = df_clean.astype({'NRO_DOC': 'str'})

## Concatenación con el archivo 0102.xlsx

In [32]:
df2 = pd.read_excel('/mnt/c/Users/Dleg/Data/MOPC/MOPC/Enriquecimiento de Datos/Data Cleaning/Clientes/BBVA/Datasets/0202/0102.xlsx', sheet_name = 'dynamic (2)')

In [33]:
df2.head()

,CLIENTE,T_DOC,NRO_DOC,NOMBRE,RESP_PRINCIPAL,RESP_CPMERCIAL,RESP_DIRECTO,AGENTE_ASIGNADO,LISTA,FEC_ULT_COBRO,...,DIAS_ATRASO,FEC_RADICA,BANCA,ZONA,DESC_ZONA,IMP_ASIGNADO,IMP_COBROS_DD_ASIGNAC,SOLVENCIA,FECHA_SOLVENCIA,S_CONTENCIOSO
0,24329259,0,32238752,CHISELINO RAFAEL ENRIQUE,"RASSORI COSTA, FERNANDO (47)",NaN,MOPC,NaN,Ag 1ra MOPC,2021-01-15,...,263,2020-08-11,34,9012,CORDOBA (9012),76661.95,15000.0,0.0,2020-09-03,61662
1,24332285,0,23597329,MASLUP ABRAHAM CARLOS,"RASSORI COSTA, FERNANDO (47)",NaN,MOPC,NaN,Ag 1ra MOPC,2020-05-07,...,116,2021-01-05,30,9014,CUYO (9014),12198.59,0.0,NaN,1899-12-31,12199
2,24336032,0,29357614,ARTAZA HECTOR,"RASSORI COSTA, FERNANDO (47)",NaN,MOPC,NaN,Ag 1ra MOPC,2020-08-19,...,263,2020-05-12,34,9001,SUR (9001),0.00,0.0,NaN,1899-12-31,40397
3,24339339,0,34108519,CARRIZO MARIANO GERARDO,"RASSORI COSTA, FERNANDO (47)",NaN,MOPC,NaN,Ag 1ra MOPC,2020-08-19,...,263,2020-05-12,34,9084,MICROCENTRO SUR (9084),0.00,0.0,NaN,1899-12-31,45639
4,24347299,0,24930124,SUAREZ PAULA LORENA,"RASSORI COSTA, FERNANDO (47)",NaN,MOPC,NaN,Ag 1ra MOPC,2020-09-14,...,263,2020-05-12,34,9001,SUR (9001),0.00,0.0,NaN,1899-12-31,22151

In [34]:
df2 = df2 [['T_DOC','NRO_DOC']]

In [35]:
df2 = df2.astype({'NRO_DOC': 'str'})

In [36]:
df2.shape

(7967, 2)

In [37]:
df2.head()

   T_DOC   NRO_DOC
0      0  32238752
1      0  23597329
2      0  29357614
3      0  34108519
4      0  24930124

In [38]:
df2['T_DOC'] = df2['T_DOC'].astype(str)

In [39]:
df2.loc[df2['T_DOC'] == '0', 'TIPO_DOC'] =  'DNI '
df2.loc[df2['T_DOC'] == '02', 'TIPO_DOC'] = 'DNI '
df2.loc[df2['T_DOC'] == '95', 'TIPO_DOC'] = 'DNI '
df2.loc[df2['T_DOC'] == '25', 'TIPO_DOC'] = 'LE  '
df2.loc[df2['T_DOC'] == '27', 'TIPO_DOC'] = 'LE  '
df2.loc[df2['T_DOC'] == '26', 'TIPO_DOC'] = 'LC  '
df2.loc[df2['T_DOC'] == '28', 'TIPO_DOC'] = 'LC  '
df2.loc[df2['T_DOC'] == '31', 'TIPO_DOC'] = 'DNIE'
df2.loc[df2['T_DOC'] == '30', 'TIPO_DOC'] = 'PAS '
df2.loc[df2['T_DOC'] == '50', 'TIPO_DOC'] = 'CUIT'
df2.loc[df2['T_DOC'] == '01', 'TIPO_DOC'] = 'CI  '

In [40]:
df2.head()

  T_DOC   NRO_DOC TIPO_DOC
0     0  32238752     DNI
1     0  23597329     DNI
2     0  29357614     DNI
3     0  34108519     DNI
4     0  24930124     DNI

In [41]:
df2 ['IDMOROSO'] = df2['TIPO_DOC'] + df2 ['NRO_DOC']

In [42]:
df2.tail()

     T_DOC   NRO_DOC TIPO_DOC      IDMOROSO
7962     0  43862360     DNI   DNI 43862360
7963     0  35462066     DNI   DNI 35462066
7964     0  34977500     DNI   DNI 34977500
7965     0  40952678     DNI   DNI 40952678
7966     0  38678299     DNI   DNI 38678299

In [43]:
df2['TIPO_DOC'] = df2['TIPO_DOC'].str.strip()

In [44]:
df2.tail()

     T_DOC   NRO_DOC TIPO_DOC      IDMOROSO
7962     0  43862360      DNI  DNI 43862360
7963     0  35462066      DNI  DNI 35462066
7964     0  34977500      DNI  DNI 34977500
7965     0  40952678      DNI  DNI 40952678
7966     0  38678299      DNI  DNI 38678299

In [45]:
df2.shape

(7967, 4)

### Concatenación

In [46]:
df_union = pd.merge(df_clean,df2, on='NRO_DOC', how='inner')

In [47]:
df_union.shape

(1092, 5)

In [48]:
df_union.head()

    NRO_DOC        DATO T_DOC TIPO_DOC      IDMOROSO
0  17999492  1559436976     0      DNI  DNI 17999492
1  17999492    48053932     0      DNI  DNI 17999492
2  17999492    48280546     0      DNI  DNI 17999492
3  17999492  1559436976     0      DNI  DNI 17999492
4  17999492    48053932     0      DNI  DNI 17999492

## Campos adicionales

In [49]:
df_union = df_union.assign(PROVEEDOR_DATO='C_F12')

In [50]:
df_union.loc[df_union['DATO'].str.startswith('11'), 'TIPO'] = 'TEL.CELULAR'
df_union.loc[df_union['DATO'].str.startswith('15'), 'TIPO'] = 'TEL.CELULAR'

In [51]:
df_union.head()

,NRO_DOC,DATO,T_DOC,TIPO_DOC,IDMOROSO,PROVEEDOR_DATO,TIPO
0,17999492,1559436976,0,DNI,DNI 17999492,C_F12,TEL.CELULAR
1,17999492,48053932,0,DNI,DNI 17999492,C_F12,NaN
2,17999492,48280546,0,DNI,DNI 17999492,C_F12,NaN
3,17999492,1559436976,0,DNI,DNI 17999492,C_F12,TEL.CELULAR
4,17999492,48053932,0,DNI,DNI 17999492,C_F12,NaN

In [52]:
df_union.loc[(df_union['TIPO'] != 'TEL.CELULAR') , 'TIPO'] = 'TEL.FIJO'

In [53]:
df_union.head()

,NRO_DOC,DATO,T_DOC,TIPO_DOC,IDMOROSO,PROVEEDOR_DATO,TIPO
0,17999492,1559436976,0,DNI,DNI 17999492,C_F12,TEL.CELULAR
1,17999492,48053932,0,DNI,DNI 17999492,C_F12,TEL.FIJO
2,17999492,48280546,0,DNI,DNI 17999492,C_F12,TEL.FIJO
3,17999492,1559436976,0,DNI,DNI 17999492,C_F12,TEL.CELULAR
4,17999492,48053932,0,DNI,DNI 17999492,C_F12,TEL.FIJO

In [54]:
df_union = df_union.assign(SUBTIPO='PERSONAL')

In [55]:
df_union = df_union.assign(PROPIETARIO_DATO='Ajeno_cotitular')

In [56]:
# Nivel 1: Laboral, proveedor externo.

df_union.loc[(df_union['SUBTIPO'] == 'LABORAL') , 'SCORE_DATO'] = 1

In [57]:
# Nivel 2: Personal, proveedor externo.

df_union.loc[(df_union['SUBTIPO'] == 'PERSONAL') , 'SCORE_DATO'] = 2

In [58]:
df_union.head()

,NRO_DOC,DATO,T_DOC,TIPO_DOC,IDMOROSO,PROVEEDOR_DATO,TIPO,SUBTIPO,PROPIETARIO_DATO,SCORE_DATO
0,17999492,1559436976,0,DNI,DNI 17999492,C_F12,TEL.CELULAR,PERSONAL,Ajeno_cotitular,2.0
1,17999492,48053932,0,DNI,DNI 17999492,C_F12,TEL.FIJO,PERSONAL,Ajeno_cotitular,2.0
2,17999492,48280546,0,DNI,DNI 17999492,C_F12,TEL.FIJO,PERSONAL,Ajeno_cotitular,2.0
3,17999492,1559436976,0,DNI,DNI 17999492,C_F12,TEL.CELULAR,PERSONAL,Ajeno_cotitular,2.0
4,17999492,48053932,0,DNI,DNI 17999492,C_F12,TEL.FIJO,PERSONAL,Ajeno_cotitular,2.0

# 10) Columna Fecha

Para el campo FECHA_INGRESO_DATO, usamos la fecha en la que se hace la inserción de los datos:

In [59]:
fecha_ingreso = pd.to_datetime('today')

In [60]:
df_union = df_union.assign(FECHA_INGRESO_DATO=fecha_ingreso)

In [61]:
df_union.head()

,NRO_DOC,DATO,T_DOC,TIPO_DOC,IDMOROSO,PROVEEDOR_DATO,TIPO,SUBTIPO,PROPIETARIO_DATO,SCORE_DATO,FECHA_INGRESO_DATO
0,17999492,1559436976,0,DNI,DNI 17999492,C_F12,TEL.CELULAR,PERSONAL,Ajeno_cotitular,2.0,2021-02-08 12:12:35.888386
1,17999492,48053932,0,DNI,DNI 17999492,C_F12,TEL.FIJO,PERSONAL,Ajeno_cotitular,2.0,2021-02-08 12:12:35.888386
2,17999492,48280546,0,DNI,DNI 17999492,C_F12,TEL.FIJO,PERSONAL,Ajeno_cotitular,2.0,2021-02-08 12:12:35.888386
3,17999492,1559436976,0,DNI,DNI 17999492,C_F12,TEL.CELULAR,PERSONAL,Ajeno_cotitular,2.0,2021-02-08 12:12:35.888386
4,17999492,48053932,0,DNI,DNI 17999492,C_F12,TEL.FIJO,PERSONAL,Ajeno_cotitular,2.0,2021-02-08 12:12:35.888386

# 11) Campos adicionales

Creamos las columnas VERIFICADO, FECHA_VERIFICACION, OPERADOR_VERIFICACION, que en principio van en nulls.

In [62]:
df_union['VERIFICADO'] = 0

In [63]:
df_union['FECHA_VERIFICACION'] = np.nan

In [64]:
df_union['OPERADOR_VERIFICACION'] = np.nan

In [65]:
df_union['CUIT_CUIL'] = np.nan

# Export

In [66]:
df_export = df_union[['IDMOROSO', 'TIPO_DOC','NRO_DOC','CUIT_CUIL','TIPO','SUBTIPO','DATO','PROPIETARIO_DATO','PROVEEDOR_DATO','FECHA_INGRESO_DATO','VERIFICADO','FECHA_VERIFICACION','OPERADOR_VERIFICACION','SCORE_DATO']]

In [67]:
df_export.head()

,IDMOROSO,TIPO_DOC,NRO_DOC,CUIT_CUIL,TIPO,SUBTIPO,DATO,PROPIETARIO_DATO,PROVEEDOR_DATO,FECHA_INGRESO_DATO,VERIFICADO,FECHA_VERIFICACION,OPERADOR_VERIFICACION,SCORE_DATO
0,DNI 17999492,DNI,17999492,NaN,TEL.CELULAR,PERSONAL,1559436976,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
1,DNI 17999492,DNI,17999492,NaN,TEL.FIJO,PERSONAL,48053932,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
2,DNI 17999492,DNI,17999492,NaN,TEL.FIJO,PERSONAL,48280546,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
3,DNI 17999492,DNI,17999492,NaN,TEL.CELULAR,PERSONAL,1559436976,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
4,DNI 17999492,DNI,17999492,NaN,TEL.FIJO,PERSONAL,48053932,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0

# Revisión de duplicados

In [68]:
duplicates_subset = df_export[df_export.duplicated(subset=['IDMOROSO','DATO','PROVEEDOR_DATO'],keep=False)]

In [69]:
duplicates_subset

,IDMOROSO,TIPO_DOC,NRO_DOC,CUIT_CUIL,TIPO,SUBTIPO,DATO,PROPIETARIO_DATO,PROVEEDOR_DATO,FECHA_INGRESO_DATO,VERIFICADO,FECHA_VERIFICACION,OPERADOR_VERIFICACION,SCORE_DATO
0,DNI 17999492,DNI,17999492,NaN,TEL.CELULAR,PERSONAL,1559436976,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
1,DNI 17999492,DNI,17999492,NaN,TEL.FIJO,PERSONAL,48053932,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
2,DNI 17999492,DNI,17999492,NaN,TEL.FIJO,PERSONAL,48280546,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
3,DNI 17999492,DNI,17999492,NaN,TEL.CELULAR,PERSONAL,1559436976,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
4,DNI 17999492,DNI,17999492,NaN,TEL.FIJO,PERSONAL,48053932,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1080,DNI 12518371,DNI,12518371,NaN,TEL.FIJO,PERSONAL,02984430970,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
1088,DNI 16499129,DNI,16499129,NaN,TEL.FIJO,PERSONAL,03564488892,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
1089,DNI 16499129,DNI,16499129,NaN,TEL.FIJO,PERSONAL,03564488892,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
1090,DNI 34347608,DNI,34347608,NaN,TEL.FIJO,PERSONAL,03329438230,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0
1091,DNI 34347608,DNI,34347608,NaN,TEL.FIJO,PERSONAL,03329438230,Ajeno_cotitular,C_F12,2021-02-08 12:12:35.888386,0,NaN,NaN,2.0

Tenemos duplicados en la tríada IDMOROSO-DATO-PROVEEDOR_DATO. Exportamos e inicializamos el pipeline de duplicados:

In [70]:
df_export = df_export.drop_duplicates()

In [71]:
df_export[df_export.duplicated(subset=['IDMOROSO','DATO','PROVEEDOR_DATO'],keep=False)]

Empty DataFrame
Columns: [IDMOROSO, TIPO_DOC, NRO_DOC, CUIT_CUIL, TIPO, SUBTIPO, DATO, PROPIETARIO_DATO, PROVEEDOR_DATO, FECHA_INGRESO_DATO, VERIFICADO, FECHA_VERIFICACION, OPERADOR_VERIFICACION, SCORE_DATO]
Index: []

In [72]:
df_export.shape

(772, 14)

# Export

In [73]:
df_export.to_csv('/mnt/c/Users/Dleg/Data/MOPC/MOPC/Enriquecimiento de Datos/Data Cleaning/Clientes/BBVA/Exports/DAM_CONTACTABILIDAD/F12_DAM_CONTACTABILIDAD_telefonos_0802.csv',index=False)